Case #1: > prog: SSSEEE
-----------------------------------------------                  
> prog.substr(pos): SSSEEE
> dhw: 1, 0
-----------------------------------------------                  
> prog.substr(pos): SSEEE
> dhw: 2, 0
-----------------------------------------------                  
> prog.substr(pos): SEEE
> dhw: 3, 0
-----------------------------------------------                  
> prog.substr(pos): EEE
> dhw: 3, 1
-----------------------------------------------                  
> prog.substr(pos): EE
> dhw: 3, 2
-----------------------------------------------                  
> prog.substr(pos): E
> dhw: 3, 3
-----------------------------------------------                  
-----------------------------------------------                  
4 4
_________________________________________________________________
Case #2: > prog: N
-----------------------------------------------                  
> prog.substr(pos): N
> dhw: 999999999, 0
-----------------------------------------------                  
-----------------------------------------------                  
1 1000000000
_________________________________________________________________
Case #3: > prog: N3(S)N2(E)N
-----------------------------------------------                  
> prog.substr(pos): N3(S)N2(E)N
> dhw: 999999999, 0
-----------------------------------------------                  
> prog.substr(pos): 3(S)N2(E)N
> mul: 3
-----------------------------------------------                  
> prog.substr(pos): S)N2(E)N
> dhw: 1, 0
-----------------------------------------------                  
> prog.substr(pos): )N2(E)N
> prog[pos]: )
> dhw: 1, 0
-----------------------------------------------                  
> dhw: 999999999, 0
> dhw: 1000000002, 0
> dhw: 2, 0
-----------------------------------------------                  
> prog.substr(pos): N2(E)N
> dhw: 1, 0
-----------------------------------------------                  
> prog.substr(pos): 2(E)N
> mul: 2
-----------------------------------------------                  
> prog.substr(pos): E)N
> dhw: 0, 1
-----------------------------------------------                  
> prog.substr(pos): )N
> prog[pos]: )
> dhw: 0, 1
-----------------------------------------------                  
> dhw: 1, 0
> dhw: 1, 2
> dhw: 1, 2
-----------------------------------------------                  
> prog.substr(pos): N
> dhw: 0, 2
-----------------------------------------------                  
-----------------------------------------------                  
3 1
_________________________________________________________________
Case #4: > prog: 2(3(NW)2(W2(EE)W))
-----------------------------------------------                  
> prog.substr(pos): 2(3(NW)2(W2(EE)W))
> mul: 2
-----------------------------------------------                  
> prog.substr(pos): 3(NW)2(W2(EE)W))
> mul: 3
-----------------------------------------------                  
> prog.substr(pos): NW)2(W2(EE)W))
> dhw: 999999999, 0
-----------------------------------------------                  
> prog.substr(pos): W)2(W2(EE)W))
> dhw: 999999999, 999999999
-----------------------------------------------                  
> prog.substr(pos): )2(W2(EE)W))
> prog[pos]: )
> dhw: 999999999, 999999999
-----------------------------------------------                  
> dhw: 0, 0
> dhw: -1294967299, -1294967299
> dhw: 705032701, 705032701
-----------------------------------------------                  
> prog.substr(pos): 2(W2(EE)W))
> mul: 2
-----------------------------------------------                  
> prog.substr(pos): W2(EE)W))
> dhw: 0, 999999999
-----------------------------------------------                  
> prog.substr(pos): 2(EE)W))
> mul: 2
-----------------------------------------------                  
> prog.substr(pos): EE)W))
> dhw: 0, 1
-----------------------------------------------                  
> prog.substr(pos): E)W))
> dhw: 0, 2
-----------------------------------------------                  
> prog.substr(pos): )W))
> prog[pos]: )
> dhw: 0, 2
-----------------------------------------------                  
> dhw: 0, 999999999
> dhw: 0, 1000000003
> dhw: 0, 3
-----------------------------------------------                  
> prog.substr(pos): W))
> dhw: 0, 2
-----------------------------------------------                  
> prog.substr(pos): ))
> prog[pos]: )
> dhw: 0, 2
-----------------------------------------------                  
> dhw: 705032701, 705032701
> dhw: 705032701, 705032705
> dhw: 705032701, 705032705
-----------------------------------------------                  
> prog.substr(pos): )
> prog[pos]: )
> dhw: 705032701, 705032705
-----------------------------------------------                  
> dhw: 0, 0
> dhw: 1410065402, 1410065410
> dhw: 410065402, 410065410
-----------------------------------------------                  
-----------------------------------------------                  
410065411 410065403
_________________________________________________________________
